In [113]:
import pandas as pd
import pymongo

In [114]:
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)

# Declare the database
db = client.us_income_in_mn_db

# Declare the collection
collection = db.us_income_in_mn_db

In [115]:
csv_file = "Resources/starbucks.csv"
starbucks_df = pd.read_csv(csv_file)
starbucks_df.head()

,Brand,Store Number,Store Name,Ownership Type,Street Address,City,State/Province,Country,Postcode,Phone Number,Timezone,Longitude,Latitude
0,Starbucks,47370-257954,"Meritxell, 96",Licensed,"Av. Meritxell, 96",Andorra la Vella,7,AD,AD500,376818720,GMT+1:00 Europe/Andorra,1.53,42.51
1,Starbucks,22331-212325,Ajman Drive Thru,Licensed,"1 Street 69, Al Jarf",Ajman,AJ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,55.47,25.42
2,Starbucks,47089-256771,Dana Mall,Licensed,Sheikh Khalifa Bin Zayed St.,Ajman,AJ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,55.47,25.39
3,Starbucks,22126-218024,Twofour 54,Licensed,Al Salam Street,Abu Dhabi,AZ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,54.38,24.48
4,Starbucks,17127-178586,Al Ain Tower,Licensed,"Khaldiya Area, Abu Dhabi Island",Abu Dhabi,AZ,AE,NaN,NaN,GMT+04:00 Asia/Dubai,54.54,24.51

In [116]:
# Create a filtered dataframe from specific columns
starbucks_cols = ["Store Number", "Store Name", "City", "State/Province"]
starbucks_transformed= starbucks_df[starbucks_cols].copy()

# Rename the column headers
starbucks_transformed = starbucks_transformed.rename(columns={"Store Number": "id",
                                                          "Store Name": "Store_name",
                                                          "State/Province": "State"})

# Clean the data by dropping duplicates and setting the index
starbucks_transformed.drop_duplicates("id", inplace=True)
starbucks_transformed.set_index("id", inplace=True)

In [117]:
columns = [
     "Store_name", "City", "State"]


starbucks_in_mn = starbucks_transformed.loc[starbucks_transformed["State"] == "MN",  columns]
starbucks_in_mn

                                       Store_name          City State
id
16960-177066              Target Alexandria T-821    Alexandria    MN
76316-95687                 Target Andover T-2025       Andover    MN
25535-241231        Round Lake Blvd and Northdale         Anoka    MN
72682-76602      Super Target Apple Valley ST-643  Apple Valley    MN
76896-121294  Super Target Apple Vly South ST-239  Apple Valley    MN
...                                           ...           ...   ...
15230-138227          Target Woodbury East T-2406      Woodbury    MN
21296-210564            Woodbury Dr. and Commerce      Woodbury    MN
72701-27209                   Kowalski - Woodbury      Woodbury    MN
28021-242084               Target Woodbury T-0694      Woodbury    MN
25759-235385             Jerry's Foods - Woodbury      Woodbury    MN

[184 rows x 3 columns]

In [118]:
csv_file2 = "Resources/us_income.csv"
us_income_df = pd.read_csv(csv_file2, encoding = "ISO-8859-1")
us_income_df.head()

,id,State_Code,State_Name,State_ab,County,City,Place,Type,Primary,Zip_Code,Area_Code,ALand,AWater,Lat,Lon,Mean,Median,Stdev,sum_w
0,1011000,1,Alabama,AL,Mobile County,Chickasaw,Chickasaw city,City,place,36611,251,10894952,909156,30.771450,-88.079697,38773,30506,33101,1638.260513
1,1011010,1,Alabama,AL,Barbour County,Louisville,Clio city,City,place,36048,334,26070325,23254,31.708516,-85.611039,37725,19528,43789,258.017685
2,1011020,1,Alabama,AL,Shelby County,Columbiana,Columbiana city,City,place,35051,205,44835274,261034,33.191452,-86.615618,54606,31930,57348,926.031000
3,1011030,1,Alabama,AL,Mobile County,Satsuma,Creola city,City,place,36572,251,36878729,2374530,30.874343,-88.009442,63919,52814,47707,378.114619
4,1011040,1,Alabama,AL,Mobile County,Dauphin Island,Dauphin Island,Town,place,36528,251,16204185,413605152,30.250913,-88.171268,77948,67225,54270,282.320328

In [119]:
# Create a filtered dataframe from specific columns
us_income_cols = ["id", "State_ab", "City", "Type", "Median"]
us_income_transformed= us_income_df[us_income_cols].copy()

# Rename the column headers
us_income_transformed = us_income_transformed.rename(columns={"State_ab": "State",
                                                              "Type": "State_type"})

# Clean the data by dropping duplicates and setting the index
us_income_transformed.drop_duplicates("id", inplace=True)
us_income_transformed.set_index("id", inplace=True)

In [120]:
#selct columns and filter by states
columns = [
     "City", "State_type", "Median"]


us_income_in_mn = us_income_transformed.loc[us_income_transformed["State"] == "MN",  columns]
us_income_in_mn

                      City State_type  Median
id
27011005       Barnesville       City   57495
27011015        Silver Bay       City  300000
27011025           Belview       City   39350
27011035          Big Lake       City   65079
27011045  Blooming Prairie       City       0
...                    ...        ...     ...
2702953         Saint Paul      Track   41601
2702963         Saint Paul      Track   69221
2702973         Saint Paul      Track   88026
2702983         Saint Paul      Track   50305
2702993    White Bear Lake      Track   66606

[641 rows x 3 columns]

In [121]:
#combined the both files
combined_files_df = pd.merge(starbucks_in_mn, us_income_in_mn,
                                 how='outer', on='City')
combined_files_df

                   Store_name         City State State_type    Median
0     Target Alexandria T-821   Alexandria    MN       City   40667.0
1     Target Alexandria T-821   Alexandria    MN      Track   51574.0
2       Target Andover T-2025      Andover    MN      Track   97983.0
3       Target Andover T-2025      Andover    MN      Track  300000.0
4       Target Andover T-2025      Andover    MN      Track   98065.0
...                       ...          ...   ...        ...       ...
2190                      NaN  Park Rapids   NaN      Track   52439.0
2191                      NaN     Sherburn   NaN      Track   54889.0
2192                      NaN     Nicollet   NaN      Track   68492.0
2193                      NaN      Henning   NaN      Track   46249.0
2194                      NaN      Fertile   NaN      Track   53165.0

[2195 rows x 5 columns]

In [122]:
# drop NaN rows
new_combined_data = combined_files_df.dropna()
new_combined_data

                    Store_name        City State State_type    Median
0      Target Alexandria T-821  Alexandria    MN       City   40667.0
1      Target Alexandria T-821  Alexandria    MN      Track   51574.0
2        Target Andover T-2025     Andover    MN      Track   97983.0
3        Target Andover T-2025     Andover    MN      Track  300000.0
4        Target Andover T-2025     Andover    MN      Track   98065.0
...                        ...         ...   ...        ...       ...
1844  Jerry's Foods - Woodbury    Woodbury    MN      Track   61373.0
1845  Jerry's Foods - Woodbury    Woodbury    MN      Track  100893.0
1846  Jerry's Foods - Woodbury    Woodbury    MN      Track  300000.0
1847  Jerry's Foods - Woodbury    Woodbury    MN      Track  300000.0
1848  Jerry's Foods - Woodbury    Woodbury    MN      Track  130058.0

[1833 rows x 5 columns]

In [123]:
# Insert the document into the database as dictionary
# The database and collection, if they don't already exist, will be created at this point.
db.collection.insert_many(new_combined_data.to_dict('records'))